backend/squared-up/app/controllers/rectangles_controller.rb

  def create
    @rectangle = Rectangle.new(rectangle_params)

    if @rectangle.save
---
INSERT INTO "rectangles" ("startX", "endX", "startY", "endY", "layout_id", "created_at", "updated_at", "color") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["startX", 324], ["endX", 526], ["startY", 32], ["endY", 159], ["layout_id", 1], ["created_at", "2020-04-12 04:20:56.324336"], ["updated_at", "2020-04-12 04:20:56.324336"], ["color", "#62b173"]]

  def update
    if @rectangle.update(rectangle_params)
---
UPDATE "rectangles" SET "startX" = $1, "startY" = $2, "endX" = $3, "endY" = $4, "color" = $5, "updated_at" = $6 WHERE "rectangles"."id" = $7  [["startX", 200], ["startY", 100], ["endX", 600], ["endY", 300], ["color", "red"], ["updated_at", "2020-04-12 04:30:15.158616"], ["id", 38]]

  def destroy
    @rectangle.destroy
---
DELETE FROM "rectangles" WHERE "rectangles"."id" = $1  [["id", 1]]

    def set_rectangle
      @rectangle = Rectangle.find(params[:id])
---
SELECT "rectangles".* FROM "rectangles" WHERE "rectangles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]